In [1]:
import pandas as pd

df= pd.read_csv(r'C:\Users\qtckp\OneDrive\Рабочий стол\Курсы\Введение в Data Science\StudentsPerformance.csv')

In [6]:
(df['lunch']=='free/reduced').mean()

0.355

In [13]:
df.loc[df['lunch']=='free/reduced'].describe()

       math score  reading score  writing score
count  355.000000     355.000000     355.000000
mean    58.921127      64.653521      63.022535
std     15.159956      14.895339      15.433823
min      0.000000      17.000000      10.000000
25%     49.000000      56.000000      53.000000
50%     60.000000      65.000000      64.000000
75%     69.000000      75.000000      74.000000
max    100.000000     100.000000     100.000000

In [14]:
df.loc[df['lunch']=='standard'].describe()

       math score  reading score  writing score
count  645.000000     645.000000     645.000000
mean    70.034109      71.654264      70.823256
std     13.653501      13.830602      14.339487
min     19.000000      26.000000      22.000000
25%     61.000000      63.000000      62.000000
50%     69.000000      72.000000      72.000000
75%     80.000000      82.000000      81.000000
max    100.000000     100.000000     100.000000